
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/paaaaay5/terraform-ecs/actions/runs/5797036586)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0157a5649b2123617]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0914e5fb0f3aa1053]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-030e23fff230102c4]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0511538431383fdaa]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-01996f1e56d9e5a2f]
aws_security_group.ecs: Refreshing state... [id=sg-0be6476e5b23a7d6e]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0312b53d701b3a36f]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:774848854882:targetgroup/go-simple-server-target-group/b3cb53bb1152686b]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01a7e3a43a003a4cc]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a6c2bd59bf6d02c2]
aws_security_group.alb: Refreshing state... [id=sg-05d7e6d822fc58988]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05d9cce52017c998c]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-00a08173e1848e10b]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07129185ac01a5f47]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-006145e36e39b1c48]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1827683724]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05c59bea5a5eec2be]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01476c50ae92d1684]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:774848854882:loadbalancer/app/go-simple-server-alb/87b30ac73477fbbb]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01a7e3a43a003a4cc1080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02d9323927f7034ce]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0b29f0f2fe8209f16]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-01aaf207c05919842]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-01c0e92fa222a8113]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e68ab255b3ad7791]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-090bcbb028c1df6a1]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-030e23fff230102c41080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0312b53d701b3a36f1080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:774848854882:listener/app/go-simple-server-alb/87b30ac73477fbbb/2f7bf68d670bd9e8]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:774848854882:listener-rule/app/go-simple-server-alb/87b30ac73477fbbb/2f7bf68d670bd9e8/8183a7fd3246820b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"f7627d7e58521e1105097660f25d0f1cdd69f560","Vars":{},"WorkflowName":"Terraform-CICD"} -->